Command: version
Result:
Cisco IOS Software, Catalyst 4500 L3 Switch Software (cat4500-IPBASEK9-M), Version 12.2(50)SG1, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2009 by Cisco Systems, Inc.
Compiled Mon 09-Feb-09 20:40 by prod_rel_team
Image text-base: 0x10000000, data-base: 0x11C294C8

ROM: 12.2(31r)SGA7
Pod Revision 0, Force Revision 31, Gill Revision 19

Switch uptime is 56 minutes
System returned to ROM by power-on
System image file is "bootflash:cat4500-ipbasek9-mz.122-50.SG1.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C4948-10GE (MPC8540) processor (revision 5) with 262144K bytes of memory.
Processor board ID FOX095107JS
MPC8540 CPU at 667Mhz, Fixed Module
Last reset from PowerUp
2 Virtual Ethernet interfaces
48 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
511K bytes of non-volatile configuration memory.

Configuration register is 0x4441

Command: module
Result:
Chassis Type : WS-C4948-10GE

Power consumed by backplane : 0 Watts

Mod Ports Card Type                              Model              Serial No.
---+-----+--------------------------------------+------------------+-----------
 1    50  10/100/1000BaseT (RJ45), 10GE (X2) Sup WS-C4948-10GE      FOX095107JS 

 M MAC addresses                    Hw  Fw           Sw               Status
--+--------------------------------+---+------------+----------------+---------
 1 0014.69d4.a980 to 0014.69d4.a9b1 2.6 12.2(31r)SGA 12.2(50)SG1      Ok

Command: fan
Result:
^
% Invalid input detected at '^' marker.

Command: inventory
Result:
NAME: "Switch System", DESCR: "Cisco Systems, Inc. WS-C4948-10GE 1 slot switch "
PID:                   , VID:      , SN: FOX095107JS

NAME: "Linecard(slot 1)", DESCR: "10/100/1000BaseT (RJ45), 10GE (X2) Supervisor with 48 10/100/1000BaseT ports an"
PID: WS-C4948-10GE     , VID: V03  , SN: FOX095107JS

NAME: "Power Supply 1", DESCR: "Power Supply ( AC 300W )"
PID: PWR-C49-300AC     , VID:      , SN: QCS1523B1FP

Command: power
Result:
^
% Invalid input detected at '^' marker.

Command: host
Result:
hostname Switch

Command: env
Result:
^
% Invalid input detected at '^' marker.

